hexeguitar/AutomatedWireCutter/software/PSoC_Creator42_project/WireCutterPSoC4_V245.cydsn/Generated_Source/PSoC4/MatrixKeypad_KbdControl.h
/*******************************************************************************
* File Name: MatrixKeypad_KbdControl.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_MatrixKeypad_KbdControl_H) /* CY_CONTROL_REG_MatrixKeypad_KbdControl_H */
#define CY_CONTROL_REG_MatrixKeypad_KbdControl_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} MatrixKeypad_KbdControl_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    MatrixKeypad_KbdControl_Write(uint8 control) ;
uint8   MatrixKeypad_KbdControl_Read(void) ;

void MatrixKeypad_KbdControl_SaveConfig(void) ;
void MatrixKeypad_KbdControl_RestoreConfig(void) ;
void MatrixKeypad_KbdControl_Sleep(void) ; 
void MatrixKeypad_KbdControl_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define MatrixKeypad_KbdControl_Control        (* (reg8 *) MatrixKeypad_KbdControl_Sync_ctrl_reg__CONTROL_REG )
#define MatrixKeypad_KbdControl_Control_PTR    (  (reg8 *) MatrixKeypad_KbdControl_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_MatrixKeypad_KbdControl_H */


/* [] END OF FILE */
